# Import Flat files like text, csv etc

## Import text file content

In [2]:
with open('./datasets/dummy_text.txt', 'r') as file:
    print(file.readline()) # print 1st line
    print(file.readline()) # print 2nd line
    print(file.readline()) # print 3rd line

#   content = file.read() # print complete content
#   print(content)

a,b,c,d,e

1,2,3,4,5

2,3,4,5,6

## Importing flat files using numpy

`Note: ` It cannot import a file containing multiple types. All content in a file should be only numeric or only strings etc

In [ ]:
import numpy as np

digits = np.loadtxt("./datasets/dummy_text.txt", delimiter=',', 
                    dtype=str, # set type of data - default is float
                    skiprows=1, # skip 1st row
                    # usecols=[0, 2], # only get 1st(index 0) and 3rd(index 2) column
                    )
print(type(digits)) # Print datatype of digits
print(digits)

<class 'numpy.ndarray'>
[['1' '2' '3' '4' '5']
 ['2' '3' '4' '5' '6']
 ['3' '4' '5' '6' '7']
 ['4' '5' '6' '7' '8']
 ['5' '6' '7' '8' '9']]

## Importing flat files using pandas

In [ ]:
import pandas as pd
df = pd.read_csv("./datasets/titanic_corrupt.csv", 
                 header=0, # set which row is header. None for setting no header. - default value is 0
                #  nrows=4, # retrieve only first 4 rows
                 sep='\t', # tab-delimited
                 comment='#', # ignore comment lines starting with '#'
                 na_values=['Nothing'] # convert 'Nothing' to missing value in complete data frame
                 )
print(df)

     1    male       22     7.25  0
0    2  female       38  71.2833  1
1    3  female       26    7.925  1
2    4  female       35     53.1  1
3    5    male  Nothing     8.05  0
4    6    male       54  51.8625  0
5    7    male        2   21.075  0
6    8    male       27  11.1333  0
7    9  female       14  Nothing  1
8   10  female        4     16.7  1
9   11    male       58    26.55  0
10  12    male       20     8.05  0
11  13  female       39   31.275  1
12  14    male  Nothing   7.8542  0
13  15  female       55       16  1
14  16    male        2   29.125  1
15  17    male  Nothing       13  0
16  18  female       31       18  1
17  19    male       45    26.55  0
18  20  female  Nothing     7.75  1

## Import excel file

In [ ]:
import pandas as pd

xls = pd.ExcelFile('./datasets/battledeath.xlsx') # Load spreadsheet: xls
print(xls.sheet_names) # Print sheet names

df1 = xls.parse('2004') # Load a sheet into a DataFrame by sheet_name
print(df1.head())

print('-----------------------------------------------------')
df2 = xls.parse(0, # Load a sheet into a DataFrame by index 
                # names=['Country', 'AAM due to War (2002)'] # rename column names
                # skiprows=[0, 1], # skip row at index 0 and 1
                # usecols=[0] # get only column at index 0
                ) 
print(df2.head())

## import SAS files of type sas7bdat

In [ ]:
from sas7bdat import SAS7BDAT

with SAS7BDAT('./datasets/sales.sas7bdat') as file:
    df_sas = file.to_data_frame() # Save file to a DataFrame

df_sas.head() # Print head of DataFrame

     YEAR     P           S
0  1950.0  12.9  181.899994
1  1951.0  11.9  245.000000
2  1952.0  10.7  250.199997
3  1953.0  11.3  265.899994
4  1954.0  11.2  248.500000

# Import stata file

`stata`: Statistics Data

In [ ]:
import pandas as pd
df = pd.read_stata('./datasets/iris.dta')
df.head()

## Import HDF5 file

In [ ]:
import h5py
import numpy as np
import matplotlib.pyplot as plt

# Load file: data
data = h5py.File('./datasets/losc_hdf5/H-H1_LOSC_16_V1-1126259446-32.hdf5', 'r')
print(type(data))

# Print name of groups
for key in data.keys():
    print(key)

print('-------------- Strain ------------------')
group = data['strain']
for key in group.keys():
    print('strain_key: ', key)

meta = np.array(data['meta']['Description'])
strain = np.array(data['strain']['Strain'])
print('meta: ', meta)
print('Strain_length: ', len(strain)) 
print('Strain: ', strain)

num_samples = 10000 # Set number of time points to sample
time = np.arange(0, 1, 1/num_samples) # Set time vector - create 10000 values b/w 0 and 1

# Plot data
plt.plot(time, strain[:num_samples])
plt.xlabel('GPS Time (s)')
plt.ylabel('strain')
plt.show()

## Import matlab file

In [ ]:
import scipy.io

mat = scipy.io.loadmat('./datasets/ja_data2.mat') # Load MATLAB file
print('TYPE: ', type(mat))

# Print the keys of the MATLAB dictionary
print('KEYS: ', mat.keys())
print('TYPE: ', type(mat['CYratioCyt']))
print('SHAPE: ', np.shape(mat['CYratioCyt']))

TYPE:  <class 'dict'>
KEYS:  dict_keys(['__header__', '__version__', '__globals__', 'rfpCyt', 'rfpNuc', 'cfpNuc', 'cfpCyt', 'yfpNuc', 'yfpCyt', 'CYratioCyt'])
TYPE:  <class 'numpy.ndarray'>
SHAPE:  (200, 137)

## Get Data from relational databases and convert to dataframe

In [ ]:
from sqlalchemy import create_engine, inspect, MetaData, text
import pandas as pd

engine = create_engine('sqlite:///datasets/Chinook.sqlite')

inspector = inspect(engine)
table_names = inspector.get_table_names()
print("TABLE NAMES: ", table_names)

con = engine.connect()
rs = con.execute(text("SELECT * FROM Album"))
df = pd.DataFrame(rs.fetchall())
print("KEYS - COLUMN NAMES: ", rs.keys())
con.close()

print(df.head())

TABLE NAMES:  ['Album', 'Artist', 'Customer', 'Employee', 'Genre', 'Invoice', 'InvoiceLine', 'MediaType', 'Playlist', 'PlaylistTrack', 'Track']
KEYS - COLUMN NAMES:  RMKeyView(['AlbumId', 'Title', 'ArtistId'])
   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [21]:
from sqlalchemy import create_engine, inspect, MetaData, text
import pandas as pd

engine = create_engine('sqlite:///datasets/Chinook.sqlite')

# Open engine in context manager
with engine.connect() as con:
     rs = con.execute(text("SELECT LastName, Title, EmployeeId, BirthDate FROM Employee WHERE EmployeeId >= 6 ORDER BY BirthDate"))
     df = pd.DataFrame(rs.fetchmany(size=3)) # fetch only 3 records
    #  df.columns = rs.keys()

print(len(df)) # Print the length of the DataFrame df
print(df.head()) # Print the head of the DataFrame df

3
   LastName       Title  EmployeeId            BirthDate
0  Callahan    IT Staff           8  1968-01-09 00:00:00
1      King    IT Staff           7  1970-05-29 00:00:00
2  Mitchell  IT Manager           6  1973-07-01 00:00:00

## Use pandas to fetch relational DB data

In [28]:
from sqlalchemy import create_engine, inspect, MetaData, text
import pandas as pd

engine = create_engine('sqlite:///datasets/Chinook.sqlite')
# df = pd.read_sql_query("SELECT * FROM Album", engine)
df = pd.read_sql_query("SELECT * FROM Album INNER JOIN Artist on Album.ArtistID = Artist.ArtistID", engine)
df.head()

,AlbumId,Title,ArtistId,ArtistId,Name
0,1,For Those About To Rock We Salute You,1,1,AC/DC
1,2,Balls to the Wall,2,2,Accept
2,3,Restless and Wild,2,2,Accept
3,4,Let There Be Rock,1,1,AC/DC
4,5,Big Ones,3,3,Aerosmith